学年クラス：3C　学籍番号：b2181930　氏名：西村貴志

In [1]:
import numpy as np
import numpy.random as random
import scipy as sp
import pandas as pd
from pandas import Series, DataFrame

In [2]:
import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns
%matplotlib inline
%precision 3

'%.3f'

In [3]:
hier_df = DataFrame(
  np.arange(9).reshape((3,3)),
  index = [
    ['a','a','b'],
    [1,2,2]
  ],
  columns = [
    ['Osaka','Tokyo','Osaka'],
    ['Blue','Red','Red']
  ]
)
hier_df

    Osaka Tokyo Osaka
     Blue   Red   Red
a 1     0     1     2
  2     3     4     5
b 2     6     7     8

In [4]:
hier_df.index.names = ['key1','key2']
hier_df.columns.names = ['city','color']
hier_df

city      Osaka Tokyo Osaka
color      Blue   Red   Red
key1 key2
a    1        0     1     2
     2        3     4     5
b    2        6     7     8

In [5]:
hier_df['Osaka']

color      Blue  Red
key1 key2
a    1        0    2
     2        3    5
b    2        6    8

In [6]:
hier_df.sum(level = 'key2', axis = 0)

city  Osaka Tokyo Osaka
color  Blue   Red   Red
key2
1         0     1     2
2         9    11    13

In [7]:
hier_df.sum(level = 'color', axis = 1)

color      Blue  Red
key1 key2
a    1        0    3
     2        3    9
b    2        6   15

In [8]:
hier_df.drop(['b'])

city      Osaka Tokyo Osaka
color      Blue   Red   Red
key1 key2
a    1        0     1     2
     2        3     4     5

In [9]:
hier_df

city      Osaka Tokyo Osaka
color      Blue   Red   Red
key1 key2
a    1        0     1     2
     2        3     4     5
b    2        6     7     8

In [10]:
hier_df = hier_df.drop(['b'])
hier_df

city      Osaka Tokyo Osaka
color      Blue   Red   Red
key1 key2
a    1        0     1     2
     2        3     4     5

In [11]:
data1 = {
  'id': ['100','102','103'],
  'name': ['Taro', 'Jiro', 'Yuzuru'],
  'city': ['Tokyo', 'Osaka', 'Sendai'],
  'birth_year': [1993, 2001, 1994]
}
df1 = DataFrame(data1)
df1

    id    name    city  birth_year
0  100    Taro   Tokyo        1993
1  102    Jiro   Osaka        2001
2  103  Yuzuru  Sendai        1994

In [12]:
data2 = {
  'id': ['100', '101', '103'],
  'math': [100, 70, 40],
  'english': [60, 80, 100]
}
df2 = DataFrame(data2)
df2

    id  math  english
0  100   100       60
1  101    70       80
2  103    40      100

In [13]:
print('(内部)結合')
pd.merge(df1,df2, on = 'id')

(内部)結合

    id    name    city  birth_year  math  english
0  100    Taro   Tokyo        1993   100       60
1  103  Yuzuru  Sendai        1994    40      100

In [14]:
print('左外部結合')
pd.merge(df1,df2, how = 'left')

左外部結合

    id    name    city  birth_year   math  english
0  100    Taro   Tokyo        1993  100.0     60.0
1  102    Jiro   Osaka        2001    NaN      NaN
2  103  Yuzuru  Sendai        1994   40.0    100.0

In [15]:
print('右外部結合')
pd.merge(df1,df2, how = 'right')

右外部結合

    id    name    city  birth_year  math  english
0  100    Taro   Tokyo      1993.0   100       60
1  101     NaN     NaN         NaN    70       80
2  103  Yuzuru  Sendai      1994.0    40      100

In [16]:
print('全結合')
pd.merge(df1,df2, how = 'outer')

全結合

    id    name    city  birth_year   math  english
0  100    Taro   Tokyo      1993.0  100.0     60.0
1  102    Jiro   Osaka      2001.0    NaN      NaN
2  103  Yuzuru  Sendai      1994.0   40.0    100.0
3  101     NaN     NaN         NaN   70.0     80.0

In [17]:
data3 = {
  'id': ['100', '101', '103', '105', '106', '107', '108', '103'],
  'name': ['Taro', 'Mai', 'Yuzuru', 'Syoma', 'Satoko', 'Rika', 'Kaori', 'Yuzuru'],
  'city': ['Tokyo', 'Kobe', 'Sendai', 'Nagoya', 'Osaka', 'Osaka', 'Kobe', 'Sendai'],
  'birth_year': [1993, 2001, 1994, 1999, 1998, 2004, 2003, 1994]
}
df3 = DataFrame(data3)
df3

    id    name    city  birth_year
0  100    Taro   Tokyo        1993
1  101     Mai    Kobe        2001
2  103  Yuzuru  Sendai        1994
3  105   Syoma  Nagoya        1999
4  106  Satoko   Osaka        1998
5  107    Rika   Osaka        2004
6  108   Kaori    Kobe        2003
7  103  Yuzuru  Sendai        1994

In [18]:
df13 = pd.concat([df1,df3])
df13

    id    name    city  birth_year
0  100    Taro   Tokyo        1993
1  102    Jiro   Osaka        2001
2  103  Yuzuru  Sendai        1994
0  100    Taro   Tokyo        1993
1  101     Mai    Kobe        2001
2  103  Yuzuru  Sendai        1994
3  105   Syoma  Nagoya        1999
4  106  Satoko   Osaka        1998
5  107    Rika   Osaka        2004
6  108   Kaori    Kobe        2003
7  103  Yuzuru  Sendai        1994

In [19]:
hier_df

city      Osaka Tokyo Osaka
color      Blue   Red   Red
key1 key2
a    1        0     1     2
     2        3     4     5

In [20]:
hier_df.stack()

city             Osaka  Tokyo
key1 key2 color
a    1    Blue       0    NaN
          Red        2    1.0
     2    Blue       3    NaN
          Red        5    4.0

In [21]:
hier_df.stack().unstack()

city      Osaka     Tokyo
color      Blue Red  Blue  Red
key1 key2
a    1        0   2   NaN  1.0
     2        3   5   NaN  4.0

In [22]:
df13.duplicated()

0    False
1    False
2    False
0     True
1    False
2     True
3    False
4    False
5    False
6    False
7     True
dtype: bool

In [23]:
df13.drop_duplicates()

    id    name    city  birth_year
0  100    Taro   Tokyo        1993
1  102    Jiro   Osaka        2001
2  103  Yuzuru  Sendai        1994
1  101     Mai    Kobe        2001
3  105   Syoma  Nagoya        1999
4  106  Satoko   Osaka        1998
5  107    Rika   Osaka        2004
6  108   Kaori    Kobe        2003

In [24]:
df13

    id    name    city  birth_year
0  100    Taro   Tokyo        1993
1  102    Jiro   Osaka        2001
2  103  Yuzuru  Sendai        1994
0  100    Taro   Tokyo        1993
1  101     Mai    Kobe        2001
2  103  Yuzuru  Sendai        1994
3  105   Syoma  Nagoya        1999
4  106  Satoko   Osaka        1998
5  107    Rika   Osaka        2004
6  108   Kaori    Kobe        2003
7  103  Yuzuru  Sendai        1994

In [25]:
city_map ={
  'Sendai': 'Tohoku',
  'Tokyo': 'Kanto',
  'Nagoya': 'Chubu',
  'Osaka': 'Kansai',
  'Kobe': 'Kansai'
}
city_map

{'Sendai': 'Tohoku',
 'Tokyo': 'Kanto',
 'Nagoya': 'Chubu',
 'Osaka': 'Kansai',
 'Kobe': 'Kansai'}

In [26]:
df13['region'] = df13['city'].map(city_map)
df13

    id    name    city  birth_year  region
0  100    Taro   Tokyo        1993   Kanto
1  102    Jiro   Osaka        2001  Kansai
2  103  Yuzuru  Sendai        1994  Tohoku
0  100    Taro   Tokyo        1993   Kanto
1  101     Mai    Kobe        2001  Kansai
2  103  Yuzuru  Sendai        1994  Tohoku
3  105   Syoma  Nagoya        1999   Chubu
4  106  Satoko   Osaka        1998  Kansai
5  107    Rika   Osaka        2004  Kansai
6  108   Kaori    Kobe        2003  Kansai
7  103  Yuzuru  Sendai        1994  Tohoku

In [27]:
df13['decades'] =df13['birth_year'].map(lambda x: str(x)[0:3])
df13

    id    name    city  birth_year  region decades
0  100    Taro   Tokyo        1993   Kanto     199
1  102    Jiro   Osaka        2001  Kansai     200
2  103  Yuzuru  Sendai        1994  Tohoku     199
0  100    Taro   Tokyo        1993   Kanto     199
1  101     Mai    Kobe        2001  Kansai     200
2  103  Yuzuru  Sendai        1994  Tohoku     199
3  105   Syoma  Nagoya        1999   Chubu     199
4  106  Satoko   Osaka        1998  Kansai     199
5  107    Rika   Osaka        2004  Kansai     200
6  108   Kaori    Kobe        2003  Kansai     200
7  103  Yuzuru  Sendai        1994  Tohoku     199

In [28]:
birth_year_bins = [1990, 1995, 2000, 2005]
birth_year_cut_data = pd.cut(df13.birth_year, birth_year_bins)
birth_year_cut_data

0    (1990, 1995]
1    (2000, 2005]
2    (1990, 1995]
0    (1990, 1995]
1    (2000, 2005]
2    (1990, 1995]
3    (1995, 2000]
4    (1995, 2000]
5    (2000, 2005]
6    (2000, 2005]
7    (1990, 1995]
Name: birth_year, dtype: category
Categories (3, interval[int64]): [(1990, 1995] < (1995, 2000] < (2000, 2005]]

In [29]:
birth_year_cut_data = pd.cut(df13.birth_year, birth_year_bins, right=False)
birth_year_cut_data

0    [1990, 1995)
1    [2000, 2005)
2    [1990, 1995)
0    [1990, 1995)
1    [2000, 2005)
2    [1990, 1995)
3    [1995, 2000)
4    [1995, 2000)
5    [2000, 2005)
6    [2000, 2005)
7    [1990, 1995)
Name: birth_year, dtype: category
Categories (3, interval[int64]): [[1990, 1995) < [1995, 2000) < [2000, 2005)]

In [30]:
pd.value_counts(birth_year_cut_data)

[1990, 1995)    5
[2000, 2005)    4
[1995, 2000)    2
Name: birth_year, dtype: int64

In [31]:
group_names = ['early1990s', 'late1990s', 'early2000s']
birth_year_cut_data = pd.cut(df13.birth_year, birth_year_bins, labels = group_names)
pd.value_counts(birth_year_cut_data)

early1990s    5
early2000s    4
late1990s     2
Name: birth_year, dtype: int64

In [32]:
df13 = df13.drop_duplicates()
df13

    id    name    city  birth_year  region decades
0  100    Taro   Tokyo        1993   Kanto     199
1  102    Jiro   Osaka        2001  Kansai     200
2  103  Yuzuru  Sendai        1994  Tohoku     199
1  101     Mai    Kobe        2001  Kansai     200
3  105   Syoma  Nagoya        1999   Chubu     199
4  106  Satoko   Osaka        1998  Kansai     199
5  107    Rika   Osaka        2004  Kansai     200
6  108   Kaori    Kobe        2003  Kansai     200

In [33]:
df13.groupby('city').size()

city
Kobe      2
Nagoya    1
Osaka     3
Sendai    1
Tokyo     1
dtype: int64

In [34]:
df13.groupby('city')['birth_year'].mean()

city
Kobe      2002
Nagoya    1999
Osaka     2001
Sendai    1994
Tokyo     1993
Name: birth_year, dtype: int64

In [35]:
df13.groupby(['region','city'])['birth_year'].mean()

region  city
Chubu   Nagoya    1999
Kansai  Kobe      2002
        Osaka     2001
Kanto   Tokyo     1993
Tohoku  Sendai    1994
Name: birth_year, dtype: int64

In [36]:
df13.groupby(['region','city'], as_index = False)['birth_year'].mean()

   region    city  birth_year
0   Chubu  Nagoya        1999
1  Kansai    Kobe        2002
2  Kansai   Osaka        2001
3   Kanto   Tokyo        1993
4  Tohoku  Sendai        1994

In [37]:
for group, subdf in df13.groupby('region'):
  print('==========================================================')
  print('Region Name:{0}'.format(group))
  print(subdf)

==========================================================
Region Name:Chubu
    id   name    city  birth_year region decades
3  105  Syoma  Nagoya        1999  Chubu     199
==========================================================
Region Name:Kansai
    id    name   city  birth_year  region decades
1  102    Jiro  Osaka        2001  Kansai     200
1  101     Mai   Kobe        2001  Kansai     200
4  106  Satoko  Osaka        1998  Kansai     199
5  107    Rika  Osaka        2004  Kansai     200
6  108   Kaori   Kobe        2003  Kansai     200
==========================================================
Region Name:Kanto
    id  name   city  birth_year region decades
0  100  Taro  Tokyo        1993  Kanto     199
==========================================================
Region Name:Tohoku
    id    name    city  birth_year  region decades
2  103  Yuzuru  Sendai        1994  Tohoku     199

***
# 演習1.

In [38]:
my_city_map ={
  'Sendai': 'Haginotsuki',
  'Tokyo': 'Edogangu',
  'Nagoya': 'Misonikomiudon',
  'Osaka': 'Konamon',
  'Kobe': 'Koubegyu'
}
my_city_map

{'Sendai': 'Haginotsuki',
 'Tokyo': 'Edogangu',
 'Nagoya': 'Misonikomiudon',
 'Osaka': 'Konamon',
 'Kobe': 'Koubegyu'}

In [39]:
df13['speciality'] = df13['city'].map(my_city_map)
df13

<ipython-input-39-f7fb6d56caf1>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df13['speciality'] = df13['city'].map(my_city_map)

    id    name    city  birth_year  region decades      speciality
0  100    Taro   Tokyo        1993   Kanto     199        Edogangu
1  102    Jiro   Osaka        2001  Kansai     200         Konamon
2  103  Yuzuru  Sendai        1994  Tohoku     199     Haginotsuki
1  101     Mai    Kobe        2001  Kansai     200        Koubegyu
3  105   Syoma  Nagoya        1999   Chubu     199  Misonikomiudon
4  106  Satoko   Osaka        1998  Kansai     199         Konamon
5  107    Rika   Osaka        2004  Kansai     200         Konamon
6  108   Kaori    Kobe        2003  Kansai     200        Koubegyu

In [40]:
my_birth_year_bins = [1990, 1993, 1996, 1999, 2002, 2005]
birth_year_cut_data = pd.cut(df13.birth_year, my_birth_year_bins)
birth_year_cut_data

0    (1990, 1993]
1    (1999, 2002]
2    (1993, 1996]
1    (1999, 2002]
3    (1996, 1999]
4    (1996, 1999]
5    (2002, 2005]
6    (2002, 2005]
Name: birth_year, dtype: category
Categories (5, interval[int64]): [(1990, 1993] < (1993, 1996] < (1996, 1999] < (1999, 2002] < (2002, 2005]]

In [41]:
birth_year_cut_data = pd.cut(df13.birth_year, my_birth_year_bins, right=False)
birth_year_cut_data

0    [1993, 1996)
1    [1999, 2002)
2    [1993, 1996)
1    [1999, 2002)
3    [1999, 2002)
4    [1996, 1999)
5    [2002, 2005)
6    [2002, 2005)
Name: birth_year, dtype: category
Categories (5, interval[int64]): [[1990, 1993) < [1993, 1996) < [1996, 1999) < [1999, 2002) < [2002, 2005)]

In [42]:
pd.value_counts(birth_year_cut_data)

[1999, 2002)    3
[2002, 2005)    2
[1993, 1996)    2
[1996, 1999)    1
[1990, 1993)    0
Name: birth_year, dtype: int64

In [43]:
group_names = ['1990s', '1993s', '1996s', '1999s', '2002s']
birth_year_cut_data = pd.cut(df13.birth_year, my_birth_year_bins, labels = group_names)
pd.value_counts(birth_year_cut_data)

2002s    2
1999s    2
1996s    2
1993s    1
1990s    1
Name: birth_year, dtype: int64

In [44]:
df13 = df13.drop_duplicates()
df13

    id    name    city  birth_year  region decades      speciality
0  100    Taro   Tokyo        1993   Kanto     199        Edogangu
1  102    Jiro   Osaka        2001  Kansai     200         Konamon
2  103  Yuzuru  Sendai        1994  Tohoku     199     Haginotsuki
1  101     Mai    Kobe        2001  Kansai     200        Koubegyu
3  105   Syoma  Nagoya        1999   Chubu     199  Misonikomiudon
4  106  Satoko   Osaka        1998  Kansai     199         Konamon
5  107    Rika   Osaka        2004  Kansai     200         Konamon
6  108   Kaori    Kobe        2003  Kansai     200        Koubegyu

In [45]:
df13.groupby('region').size()

region
Chubu     1
Kansai    5
Kanto     1
Tohoku    1
dtype: int64

In [46]:
df13.groupby('region')['birth_year'].mean()

region
Chubu     1999.0
Kansai    2001.4
Kanto     1993.0
Tohoku    1994.0
Name: birth_year, dtype: float64

In [47]:
df13.groupby(['region','speciality'])['birth_year'].mean()

region  speciality
Chubu   Misonikomiudon    1999
Kansai  Konamon           2001
        Koubegyu          2002
Kanto   Edogangu          1993
Tohoku  Haginotsuki       1994
Name: birth_year, dtype: int64

In [48]:
df13.groupby(['region','speciality'], as_index = False)['birth_year'].mean()

   region      speciality  birth_year
0   Chubu  Misonikomiudon        1999
1  Kansai         Konamon        2001
2  Kansai        Koubegyu        2002
3   Kanto        Edogangu        1993
4  Tohoku     Haginotsuki        1994

In [49]:
for group, subdf in df13.groupby('speciality'):
  print('==========================================================')
  print('Speciality Name:{0}'.format(group))
  print(subdf)

==========================================================
Speciality Name:Edogangu
    id  name   city  birth_year region decades speciality
0  100  Taro  Tokyo        1993  Kanto     199   Edogangu
==========================================================
Speciality Name:Haginotsuki
    id    name    city  birth_year  region decades   speciality
2  103  Yuzuru  Sendai        1994  Tohoku     199  Haginotsuki
==========================================================
Speciality Name:Konamon
    id    name   city  birth_year  region decades speciality
1  102    Jiro  Osaka        2001  Kansai     200    Konamon
4  106  Satoko  Osaka        1998  Kansai     199    Konamon
5  107    Rika  Osaka        2004  Kansai     200    Konamon
==========================================================
Speciality Name:Koubegyu
    id   name  city  birth_year  region decades speciality
1  101    Mai  Kobe        2001  Kansai     200   Koubegyu
6  108  Kaori  Kobe        2003  Kansai     200   Koubegyu
==========================================================
Speciality Name:Misonikomiudon
    id   name    city  birth_year region decades      speciality
3  105  Syoma  Nagoya        1999  Chubu     199  Misonikomiudon

***

In [50]:
import numpy as np
from numpy import nan as NA
import pandas as pd
df = pd.DataFrame(np.random.rand(10, 4))
df

          0         1         2         3
0  0.050052  0.549352  0.148363  0.368416
1  0.848846  0.218534  0.235178  0.122675
2  0.819163  0.265470  0.425752  0.348555
3  0.189909  0.581235  0.777128  0.842344
4  0.118511  0.409993  0.970406  0.780387
5  0.315929  0.984857  0.992114  0.971994
6  0.748102  0.324673  0.440033  0.519653
7  0.275997  0.551785  0.741044  0.324812
8  0.916345  0.273637  0.648422  0.784018
9  0.289279  0.765873  0.597236  0.373507

In [51]:
df.iloc[1,0] = NA
df.iloc[2:3,2] =NA
df.iloc[5:,3] = NA
df

          0         1         2         3
0  0.050052  0.549352  0.148363  0.368416
1       NaN  0.218534  0.235178  0.122675
2  0.819163  0.265470       NaN  0.348555
3  0.189909  0.581235  0.777128  0.842344
4  0.118511  0.409993  0.970406  0.780387
5  0.315929  0.984857  0.992114       NaN
6  0.748102  0.324673  0.440033       NaN
7  0.275997  0.551785  0.741044       NaN
8  0.916345  0.273637  0.648422       NaN
9  0.289279  0.765873  0.597236       NaN

In [52]:
df.dropna()

          0         1         2         3
0  0.050052  0.549352  0.148363  0.368416
3  0.189909  0.581235  0.777128  0.842344
4  0.118511  0.409993  0.970406  0.780387

In [53]:
df[[0,1,2]].dropna()

          0         1         2
0  0.050052  0.549352  0.148363
3  0.189909  0.581235  0.777128
4  0.118511  0.409993  0.970406
5  0.315929  0.984857  0.992114
6  0.748102  0.324673  0.440033
7  0.275997  0.551785  0.741044
8  0.916345  0.273637  0.648422
9  0.289279  0.765873  0.597236

In [54]:
df.fillna(method = 'ffill')

          0         1         2         3
0  0.050052  0.549352  0.148363  0.368416
1  0.050052  0.218534  0.235178  0.122675
2  0.819163  0.265470  0.235178  0.348555
3  0.189909  0.581235  0.777128  0.842344
4  0.118511  0.409993  0.970406  0.780387
5  0.315929  0.984857  0.992114  0.780387
6  0.748102  0.324673  0.440033  0.780387
7  0.275997  0.551785  0.741044  0.780387
8  0.916345  0.273637  0.648422  0.780387
9  0.289279  0.765873  0.597236  0.780387

In [55]:
df.fillna(df.mean())

          0         1         2         3
0  0.050052  0.549352  0.148363  0.368416
1  0.413698  0.218534  0.235178  0.122675
2  0.819163  0.265470  0.616658  0.348555
3  0.189909  0.581235  0.777128  0.842344
4  0.118511  0.409993  0.970406  0.780387
5  0.315929  0.984857  0.992114  0.492475
6  0.748102  0.324673  0.440033  0.492475
7  0.275997  0.551785  0.741044  0.492475
8  0.916345  0.273637  0.648422  0.492475
9  0.289279  0.765873  0.597236  0.492475

In [56]:
df.mean()

0    0.413698
1    0.492541
2    0.616658
3    0.492475
dtype: float64

***
# 演習2.

In [57]:
my_df = pd.DataFrame(np.random.rand(100, 100))
my_df

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
0,0.250112,0.144642,0.419860,0.946207,0.832182,0.535032,0.748677,0.923973,0.117612,0.607646,...,0.039420,0.123151,0.179274,0.365388,0.332492,0.462156,0.687624,0.228477,0.919382,0.990815
1,0.316840,0.901183,0.339023,0.377493,0.263785,0.696876,0.566262,0.058768,0.247995,0.398786,...,0.497645,0.615922,0.295298,0.833291,0.351480,0.659605,0.053635,0.236447,0.732622,0.113716
2,0.945925,0.767999,0.862488,0.041021,0.191046,0.531072,0.474715,0.175996,0.017310,0.217142,...,0.994248,0.560483,0.097596,0.921734,0.723946,0.064972,0.850024,0.190095,0.794244,0.232101
3,0.840219,0.310100,0.696598,0.720901,0.347368,0.773542,0.064028,0.174738,0.741460,0.132891,...,0.541253,0.555694,0.766592,0.634957,0.074233,0.014079,0.279672,0.087417,0.324661,0.472245
4,0.086931,0.937127,0.967126,0.382733,0.521132,0.809638,0.368407,0.169150,0.378170,0.497087,...,0.429340,0.650175,0.670274,0.646570,0.498613,0.311369,0.037120,0.582864,0.123108,0.709442
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,0.110483,0.451687,0.831684,0.168610,0.565772,0.752813,0.040397,0.981402,0.696750,0.682943,...,0.691423,0.681476,0.523253,0.271305,0.884609,0.990465,0.985212,0.380247,0.922034,0.067211
96,0.313829,0.685883,0.736966,0.350571,0.590498,0.184538,0.386218,0.131782,0.302042,0.196728,...,0.085262,0.663724,0.474233,0.079758,0.783511,0.705273,0.238974,0.532075,0.690900,0.335534
97,0.323889,0.647530,0.546134,0.470570,0.748803,0.779602,0.786953,0.642750,0.269632,0.748616,...,0.911689,0.239433,0.912108,0.006881,0.976485,0.227076,0.214810,0.150650,0.127018,0.794423
98,0.272628,0.981539,0.639823,0.485241,0.750097,0.375968,0.814059,0.870706,0.468213,0.293771,...,0.207418,0.162899,0.187122,0.030995,0.155999,0.672748,0.774300,0.488969,0.210992,0.710428
99,0.794282,0.204434,0.401602,0.797507,0.463716,0.511226,0.539961,0.494961,0.227942,0.923885,...,0.380205,0.150982,0.485830,0.094984,0.917466,0.732714,0.207480,0.164407,0.984098,0.586856

In [58]:
for i in range(random.randint(0, my_df.size)):
  my_df.iloc[random.randint(0, len(my_df)-1), random.randint(0, len(my_df.columns)-1)] = NA
my_df

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
0,0.250112,0.144642,0.419860,0.946207,0.832182,0.535032,0.748677,0.923973,0.117612,0.607646,...,0.039420,0.123151,0.179274,0.365388,0.332492,0.462156,0.687624,NaN,0.919382,0.990815
1,0.316840,0.901183,0.339023,0.377493,0.263785,0.696876,0.566262,0.058768,0.247995,0.398786,...,0.497645,0.615922,0.295298,0.833291,0.351480,NaN,0.053635,0.236447,0.732622,0.113716
2,0.945925,0.767999,0.862488,0.041021,0.191046,0.531072,0.474715,0.175996,0.017310,0.217142,...,0.994248,0.560483,0.097596,0.921734,0.723946,0.064972,0.850024,NaN,0.794244,0.232101
3,0.840219,NaN,0.696598,0.720901,0.347368,0.773542,0.064028,0.174738,0.741460,0.132891,...,0.541253,0.555694,NaN,0.634957,0.074233,0.014079,0.279672,0.087417,0.324661,0.472245
4,0.086931,NaN,0.967126,NaN,0.521132,0.809638,0.368407,0.169150,0.378170,0.497087,...,NaN,0.650175,0.670274,NaN,0.498613,0.311369,0.037120,0.582864,0.123108,0.709442
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,0.110483,NaN,0.831684,NaN,0.565772,NaN,0.040397,0.981402,0.696750,0.682943,...,0.691423,0.681476,0.523253,0.271305,0.884609,0.990465,0.985212,0.380247,0.922034,0.067211
96,0.313829,0.685883,0.736966,0.350571,0.590498,0.184538,0.386218,0.131782,NaN,0.196728,...,NaN,0.663724,0.474233,0.079758,0.783511,0.705273,0.238974,0.532075,0.690900,0.335534
97,0.323889,0.647530,NaN,0.470570,0.748803,0.779602,0.786953,0.642750,0.269632,0.748616,...,0.911689,0.239433,NaN,0.006881,0.976485,0.227076,0.214810,0.150650,0.127018,0.794423
98,0.272628,NaN,0.639823,0.485241,0.750097,0.375968,0.814059,0.870706,0.468213,0.293771,...,0.207418,0.162899,0.187122,0.030995,0.155999,0.672748,0.774300,0.488969,NaN,0.710428
99,0.794282,0.204434,0.401602,0.797507,0.463716,0.511226,0.539961,0.494961,0.227942,0.923885,...,0.380205,0.150982,0.485830,0.094984,0.917466,0.732714,0.207480,0.164407,0.984098,0.586856

In [60]:
my_df.dropna()

           0         1         2         3
0   0.250112  0.144642  0.419860  0.946207
1   0.316840  0.901183  0.339023  0.377493
2   0.945925  0.767999  0.862488  0.041021
5   0.580775  0.193809  0.995063  0.953212
7   0.603059  0.977540  0.934962  0.797901
8   0.394884  0.951118  0.810912  0.460000
9   0.358546  0.775823  0.810778  0.202586
10  0.768395  0.021163  0.923466  0.250760
11  0.113088  0.022765  0.426827  0.064795
12  0.381600  0.581685  0.527152  0.018114
14  0.080026  0.205139  0.141911  0.620881
15  0.759983  0.689493  0.925865  0.331822
21  0.528255  0.449614  0.961484  0.153071
22  0.054503  0.020889  0.768333  0.685970
29  0.467689  0.139314  0.706567  0.719020
31  0.370064  0.021668  0.840717  0.662182
32  0.892903  0.533111  0.227465  0.621788
33  0.837252  0.614944  0.057232  0.627303
35  0.575060  0.651808  0.987149  0.248370
36  0.882940  0.254268  0.098078  0.177672
38  0.335637  0.066601  0.826350  0.075544
40  0.620872  0.891602  0.557577  0.260592
41  0.540247  0.696182  0.364037  0.948474
42  0.276707  0.224189  0.761371  0.062765
43  0.235691  0.568024  0.845787  0.689734
46  0.462502  0.613747  0.839681  0.399353
49  0.720868  0.870631  0.766148  0.548947
52  0.374695  0.106739  0.054367  0.918066
53  0.555234  0.934816  0.206838  0.558685
54  0.118128  0.227607  0.585395  0.927962
55  0.927573  0.440558  0.777324  0.279661
56  0.375731  0.381437  0.843268  0.990451
58  0.873979  0.198681  0.305828  0.864572
59  0.545254  0.306225  0.523077  0.852572
60  0.561763  0.458064  0.290264  0.919408
62  0.437820  0.688271  0.151579  0.119271
63  0.552766  0.475831  0.218808  0.644302
64  0.220779  0.006555  0.371550  0.253918
67  0.568446  0.111627  0.645250  0.300697
69  0.170219  0.156530  0.215798  0.447959
71  0.411881  0.295456  0.768149  0.666474
74  0.069249  0.843855  0.913088  0.219217
75  0.788234  0.854802  0.751726  0.054612
80  0.995713  0.118212  0.692964  0.675307
81  0.091985  0.982334  0.844624  0.093020
82  0.831448  0.179636  0.994479  0.968978
83  0.467628  0.060390  0.051395  0.797795
87  0.438388  0.360023  0.041361  0.538920
88  0.839056  0.918565  0.087034  0.654749
89  0.640347  0.125215  0.676799  0.046889
91  0.331655  0.458903  0.811628  0.868758
92  0.330535  0.659220  0.661447  0.160755
93  0.197540  0.341389  0.437161  0.570091
96  0.313829  0.685883  0.736966  0.350571
99  0.794282  0.204434  0.401602  0.797507

In [61]:
my_df.fillna(method = 'ffill')

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
0,0.250112,0.144642,0.419860,0.946207,0.832182,0.535032,0.748677,0.923973,0.117612,0.607646,...,0.039420,0.123151,0.179274,0.365388,0.332492,0.462156,0.687624,NaN,0.919382,0.990815
1,0.316840,0.901183,0.339023,0.377493,0.263785,0.696876,0.566262,0.058768,0.247995,0.398786,...,0.497645,0.615922,0.295298,0.833291,0.351480,0.462156,0.053635,0.236447,0.732622,0.113716
2,0.945925,0.767999,0.862488,0.041021,0.191046,0.531072,0.474715,0.175996,0.017310,0.217142,...,0.994248,0.560483,0.097596,0.921734,0.723946,0.064972,0.850024,0.236447,0.794244,0.232101
3,0.840219,0.767999,0.696598,0.720901,0.347368,0.773542,0.064028,0.174738,0.741460,0.132891,...,0.541253,0.555694,0.097596,0.634957,0.074233,0.014079,0.279672,0.087417,0.324661,0.472245
4,0.086931,0.767999,0.967126,0.720901,0.521132,0.809638,0.368407,0.169150,0.378170,0.497087,...,0.541253,0.650175,0.670274,0.634957,0.498613,0.311369,0.037120,0.582864,0.123108,0.709442
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,0.110483,0.229989,0.831684,0.570091,0.565772,0.955109,0.040397,0.981402,0.696750,0.682943,...,0.691423,0.681476,0.523253,0.271305,0.884609,0.990465,0.985212,0.380247,0.922034,0.067211
96,0.313829,0.685883,0.736966,0.350571,0.590498,0.184538,0.386218,0.131782,0.696750,0.196728,...,0.691423,0.663724,0.474233,0.079758,0.783511,0.705273,0.238974,0.532075,0.690900,0.335534
97,0.323889,0.647530,0.736966,0.470570,0.748803,0.779602,0.786953,0.642750,0.269632,0.748616,...,0.911689,0.239433,0.474233,0.006881,0.976485,0.227076,0.214810,0.150650,0.127018,0.794423
98,0.272628,0.647530,0.639823,0.485241,0.750097,0.375968,0.814059,0.870706,0.468213,0.293771,...,0.207418,0.162899,0.187122,0.030995,0.155999,0.672748,0.774300,0.488969,0.127018,0.710428
99,0.794282,0.204434,0.401602,0.797507,0.463716,0.511226,0.539961,0.494961,0.227942,0.923885,...,0.380205,0.150982,0.485830,0.094984,0.917466,0.732714,0.207480,0.164407,0.984098,0.586856

In [62]:
my_df.fillna(my_df.mean())

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
0,0.250112,0.144642,0.419860,0.946207,0.832182,0.535032,0.748677,0.923973,0.117612,0.607646,...,0.039420,0.123151,0.179274,0.365388,0.332492,0.462156,0.687624,0.491966,0.919382,0.990815
1,0.316840,0.901183,0.339023,0.377493,0.263785,0.696876,0.566262,0.058768,0.247995,0.398786,...,0.497645,0.615922,0.295298,0.833291,0.351480,0.511678,0.053635,0.236447,0.732622,0.113716
2,0.945925,0.767999,0.862488,0.041021,0.191046,0.531072,0.474715,0.175996,0.017310,0.217142,...,0.994248,0.560483,0.097596,0.921734,0.723946,0.064972,0.850024,0.491966,0.794244,0.232101
3,0.840219,0.471016,0.696598,0.720901,0.347368,0.773542,0.064028,0.174738,0.741460,0.132891,...,0.541253,0.555694,0.466057,0.634957,0.074233,0.014079,0.279672,0.087417,0.324661,0.472245
4,0.086931,0.471016,0.967126,0.486520,0.521132,0.809638,0.368407,0.169150,0.378170,0.497087,...,0.510724,0.650175,0.670274,0.485504,0.498613,0.311369,0.037120,0.582864,0.123108,0.709442
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,0.110483,0.471016,0.831684,0.486520,0.565772,0.508591,0.040397,0.981402,0.696750,0.682943,...,0.691423,0.681476,0.523253,0.271305,0.884609,0.990465,0.985212,0.380247,0.922034,0.067211
96,0.313829,0.685883,0.736966,0.350571,0.590498,0.184538,0.386218,0.131782,0.464718,0.196728,...,0.510724,0.663724,0.474233,0.079758,0.783511,0.705273,0.238974,0.532075,0.690900,0.335534
97,0.323889,0.647530,0.567610,0.470570,0.748803,0.779602,0.786953,0.642750,0.269632,0.748616,...,0.911689,0.239433,0.466057,0.006881,0.976485,0.227076,0.214810,0.150650,0.127018,0.794423
98,0.272628,0.471016,0.639823,0.485241,0.750097,0.375968,0.814059,0.870706,0.468213,0.293771,...,0.207418,0.162899,0.187122,0.030995,0.155999,0.672748,0.774300,0.488969,0.503368,0.710428
99,0.794282,0.204434,0.401602,0.797507,0.463716,0.511226,0.539961,0.494961,0.227942,0.923885,...,0.380205,0.150982,0.485830,0.094984,0.917466,0.732714,0.207480,0.164407,0.984098,0.586856

In [63]:
my_df.mean()

0     0.489765
1     0.471016
2     0.567610
3     0.486520
4     0.504872
        ...
95    0.511678
96    0.481132
97    0.491966
98    0.503368
99    0.474662
Length: 100, dtype: float64

***